_posts/2013-06-16-Automatic,-temporary-directory-changing.html
---
title: Automatic, temporary directory changing
date: 2013/06/16 09:09:22
updated: 2013/06/16 09:09:22
categories: programming
tags: 
---


<p>
If you are doing some analysis that requires you to change directories, e.g. to read a file, and then change back to another directory to read another file, you have probably run into problems if there is an error somewhere. You would like to make sure that the code changes back to the original directory after each error. We will look at a few ways to accomplish that here.
</p>

<p>
The try/except/finally method is the traditional way to handle exceptions, and make sure that some code "finally" runs. Let us look at two examples here. In the first example, we try to change into a directory that does not exist.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> os, sys

CWD = os.getcwd() <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">store initial position</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'initially inside {0}'</span>.format(os.getcwd())
TEMPDIR = <span style="color: #228b22;">'data/run1'</span> <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">this does not exist</span>

<span style="color: #8b0000;">try:</span>
    os.chdir(TEMPDIR)
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'inside {0}'</span>.format(os.getcwd())
<span style="color: #8b0000;">except:</span>
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Exception caught: '</span>,sys.exc_info()[0]
<span style="color: #8b0000;">finally:</span>
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Running final code'</span>
    os.chdir(CWD)
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'finally inside {0}'</span>.format(os.getcwd())
</pre>
</div>

<pre class="example">
initially inside c:\users\jkitchin\Dropbox\pycse
Exception caught:  &lt;type 'exceptions.WindowsError'&gt;
Running final code
finally inside c:\users\jkitchin\Dropbox\pycse
</pre>


<p>
Now, let us look at an example where the directory does exist. We will change into the directory, run some code, and then raise an Exception.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> os, sys

CWD = os.getcwd() <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">store initial position</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'initially inside {0}'</span>.format(os.getcwd())
TEMPDIR = <span style="color: #228b22;">'data'</span>

<span style="color: #8b0000;">try:</span>
    os.chdir(TEMPDIR)
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'inside {0}'</span>.format(os.getcwd())
    <span style="color: #8b0000;">print</span> os.listdir(<span style="color: #228b22;">'.'</span>)
    <span style="color: #8b0000;">raise</span> <span style="color: #cd0000;">Exception</span>(<span style="color: #228b22;">'boom'</span>)
<span style="color: #8b0000;">except:</span>
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Exception caught: '</span>,sys.exc_info()[0]
<span style="color: #8b0000;">finally:</span>
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Running final code'</span>
    os.chdir(CWD)
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'finally inside {0}'</span>.format(os.getcwd())
</pre>
</div>

<pre class="example">
initially inside c:\users\jkitchin\Dropbox\pycse
inside c:\users\jkitchin\Dropbox\pycse\data
['antoine_data.dat', 'antoine_database.mat', 'commonshellsettings.xml', 'cstr-zeroth-order.xlsx', 'debug-2.txt', 'debug-3.txt', 'debug-4.txt', 'debug.txt', 'example.xlsx', 'example2.xls', 'example3.xls', 'example4.xls', 'example4.xlsx', 'Flash_Example.apw', 'Flash_Example.bkp', 'Flash_Example.def', 'gc-data-21.txt', 'PT.txt', 'raman.txt', 'testdata.txt']
Exception caught:  &lt;type 'exceptions.Exception'&gt;
Running final code
finally inside c:\users\jkitchin\Dropbox\pycse
</pre>

<p>
You can see that we changed into the directory, ran some code, and then caught an exception. Afterwards, we changed back to our original directory. This code works fine, but it is somewhat verbose, and tedious to write over and over. We can get a cleaner syntax with a context manager. The context manager uses the <code>with</code> keyword in python. In a context manager some code is executed on entering the "context", and code is run on exiting the context. We can use that to automatically change directory, and when done, change back to the original directory. We use the <code>contextlib.contextmanager</code> decorator on a function. With a function, the code up to a <code>yield</code> statement is run on entering the context, and the code after the yield statement is run on exiting. We wrap the yield statement in try/except/finally block to make sure our final code gets run.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> contextlib
<span style="color: #8b0000;">import</span> os, sys

<span style="color: #8b0000;">@contextlib</span>.contextmanager
<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">cd</span>(path):
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'initially inside {0}'</span>.format(os.getcwd())
    CWD = os.getcwd()
    
    os.chdir(path)
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'inside {0}'</span>.format(os.getcwd())
    <span style="color: #8b0000;">try:</span>
        <span style="color: #8b0000;">yield</span>
    <span style="color: #8b0000;">except:</span>
        <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Exception caught: '</span>,sys.exc_info()[0]
    <span style="color: #8b0000;">finally:</span>
        <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'finally inside {0}'</span>.format(os.getcwd())
        os.chdir(CWD)

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Now we use the context manager</span>
<span style="color: #8b0000;">with</span> cd(<span style="color: #228b22;">'data'</span>):
    <span style="color: #8b0000;">print</span> os.listdir(<span style="color: #228b22;">'.'</span>)
    <span style="color: #8b0000;">raise</span> <span style="color: #cd0000;">Exception</span>(<span style="color: #228b22;">'boom'</span>)

<span style="color: #8b0000;">print</span>
<span style="color: #8b0000;">with</span> cd(<span style="color: #228b22;">'data/run2'</span>):
    <span style="color: #8b0000;">print</span> os.listdir(<span style="color: #228b22;">'.'</span>)
</pre>
</div>

<p>
One case that is not handled well with this code is if the directory you want to change into does not exist. In that case an exception is raised on entering the context when you try change into a directory that does not exist. An alternative class based context manager can be found <a href="http://code.activestate.com/recipes/576620-changedirectory-context-manager/">here</a>. 
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/06/16/Automatic,-temporary-directory-changing.org">org-mode source</a><p>